zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_gfxtim.c
  return status;
}

/**
  * @brief  This function starts a relative Timer.
  * @param  hgfxtim GFXTIM handle.
  * @param  RelativeTimer Relative timer counter to Enable
  *         This parameter can be a value of @ref GFXTIM_RelativeTimer.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_GFXTIM_RelativeTimer_Start(GFXTIM_HandleTypeDef *hgfxtim, uint32_t RelativeTimer)
{
  HAL_StatusTypeDef status = HAL_OK;

  if (hgfxtim == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check parameters */
    assert_param(IS_GFXTIM_ALL_INSTANCE(hgfxtim->Instance));
    assert_param(IS_GFXTIM_RELATIVE_TIMER(RelativeTimer));

    if (hgfxtim->State == HAL_GFXTIM_STATE_READY)
    {
      if (RelativeTimer == GFXTIM_RELATIVE_TIMER1)
      {
        /* Enable relative timer 1 */
        SET_BIT(hgfxtim->Instance->TCR, GFXTIM_TCR_RFC1EN);
      }
      else
      {
        /* Enable relative timer 2 */
        SET_BIT(hgfxtim->Instance->TCR, GFXTIM_TCR_RFC2EN);
      }
    }
    else
    {
      status = HAL_ERROR;
    }
  }

  return status;
}

/**
  * @brief  This function stops a relative Timer counter.
  * @param  hgfxtim GFXTIM handle.
  * @param  RelativeTimer Relative timer counter to Disable
  *         This parameter can be a value of @ref GFXTIM_RelativeTimer.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_GFXTIM_RelativeTimer_Stop(GFXTIM_HandleTypeDef *hgfxtim, uint32_t RelativeTimer)
{
  HAL_StatusTypeDef status = HAL_OK;

  if (hgfxtim == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check parameters */
    assert_param(IS_GFXTIM_ALL_INSTANCE(hgfxtim->Instance));
    assert_param(IS_GFXTIM_RELATIVE_TIMER(RelativeTimer));

    if (hgfxtim->State == HAL_GFXTIM_STATE_READY)
    {
      if (RelativeTimer == GFXTIM_RELATIVE_TIMER1)
      {
        /* Disable relative timer 1 */
        SET_BIT(hgfxtim->Instance->TDR, GFXTIM_TDR_RFC1DIS);
      }
      else
      {
        /* Disable relative timer 2 */
        SET_BIT(hgfxtim->Instance->TDR, GFXTIM_TDR_RFC2DIS);
      }
    }
    else
    {
      status = HAL_ERROR;
    }
  }

  return status;
}


/**
  * @brief  This function force a relative Timer reload.
  * @param  hgfxtim GFXTIM handle.
  * @param  RelativeTimer Relative timer to Foce Reload
  *           This parameter can be a value of @ref GFXTIM_RelativeTimer.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_GFXTIM_RelativeTimer_ForceReload(GFXTIM_HandleTypeDef *hgfxtim, uint32_t RelativeTimer)
{
  HAL_StatusTypeDef status = HAL_OK;

  if (hgfxtim == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check parameters */
    assert_param(IS_GFXTIM_ALL_INSTANCE(hgfxtim->Instance));
    assert_param(IS_GFXTIM_RELATIVE_TIMER(RelativeTimer));

    if (hgfxtim->State == HAL_GFXTIM_STATE_READY)
    {
      if (RelativeTimer == GFXTIM_RELATIVE_TIMER1)
      {
        /* Force relative timer 1 reload */
        SET_BIT(hgfxtim->Instance->TCR, GFXTIM_TCR_FRFC1R);
      }
      else
      {
        /* Force relative timer 2 reload*/
        SET_BIT(hgfxtim->Instance->TCR, GFXTIM_TCR_FRFC2R);
      }
    }
    else
    {
      status = HAL_ERROR;
    }
  }

  return status;
}


/**
  * @brief  This function sets Relative frame timer reload value.
  * @param  hgfxtim GFXTIM handle.
  * @param  RelativeTimer specifies the Auto-reload register to be modified.
  *         This parameter can be a value of @ref GFXTIM_RelativeTimer.
  * @param  Value Reload value
  *         This parameter can be a number between Min_Data = 0x000 and Max_Data = 0xFFF
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_GFXTIM_RelativeTimer_SetReload(GFXTIM_HandleTypeDef *hgfxtim, uint32_t RelativeTimer,
                                                     uint32_t Value)
{
  HAL_StatusTypeDef status = HAL_OK;

  if (hgfxtim == NULL)
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check parameters */
    assert_param(IS_GFXTIM_ALL_INSTANCE(hgfxtim->Instance));
    assert_param(IS_GFXTIM_RELATIVE_FRAME_VALUE(Value));
    assert_param(IS_GFXTIM_RELATIVE_TIMER(RelativeTimer));

    if (hgfxtim->State == HAL_GFXTIM_STATE_READY)
    {
      if (RelativeTimer == GFXTIM_RELATIVE_TIMER1)
      {
        /* Set RFC1 auto reload */
        WRITE_REG(hgfxtim->Instance->RFC1RR, Value);
      }
      else
      {
        /* Set RFC2 auto reload */
        WRITE_REG(hgfxtim->Instance->RFC2RR, Value);
      }
    }
    else
    {
      status = HAL_ERROR;
    }
  }

  return status;
}

/**
  * @brief  This function sets Relative frame timer compare value.
  * @param  hgfxtim GFXTIM handle.
  * @param  RelativeTimer Relative frame counter reload
  *         This parameter can be a value of @ref GFXTIM_RelativeTimer.
  * @param  pValue pointer to a relative frame counter value
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_GFXTIM_RelativeTimer_GetCounter(const GFXTIM_HandleTypeDef *hgfxtim, uint32_t RelativeTimer,
                                                      uint32_t *pValue)
{
  HAL_StatusTypeDef status = HAL_OK;

  if ((hgfxtim == NULL) || (pValue == NULL))
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check parameters */
    assert_param(IS_GFXTIM_ALL_INSTANCE(hgfxtim->Instance));
    assert_param(IS_GFXTIM_RELATIVE_TIMER(RelativeTimer));

    if (hgfxtim->State == HAL_GFXTIM_STATE_READY)
    {
      if (RelativeTimer == GFXTIM_RELATIVE_TIMER1)
      {
        /* Set RFC1 auto reload */
        *pValue = READ_REG(hgfxtim->Instance->RFC1R);
      }
      else
      {
        /* Set RFC2 auto reload */
        *pValue = READ_REG(hgfxtim->Instance->RFC2R);
      }
    }
    else
    {
      status = HAL_ERROR;
    }
  }

  return status;
}




/**
  * @brief  GFXTIM Relative frame counter 1 reload callback.
  * @param  hgfxtim GFXTIM handle.
  * @retval None.
  */
__weak void HAL_GFXTIM_RelativeTimer_RFC1RCallback(GFXTIM_HandleTypeDef *hgfxtim)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hgfxtim);
  /* NOTE : This function should not be modified, when the function is needed,
            the HAL_GFXTIM_RelativeTimer_RFC1RCallback could be implemented in the user file */
}

/**
  * @brief  GFXTIM Relative frame counter 2 reload callback.
  * @param  hgfxtim GFXTIM handle.
  * @retval None.
  */
__weak void HAL_GFXTIM_RelativeTimer_RFC2RCallback(GFXTIM_HandleTypeDef *hgfxtim)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hgfxtim);
  /* NOTE : This function should not be modified, when the function is needed,
            the HAL_GFXTIM_RelativeTimer_RFC2RCallback could be implemented in the user file */
}

/**
  * @}
  */

/** @defgroup GFXTIM_Exported_Functions_Group5 Event Generator functions
  * @brief    Event Generator functions
  *
@verbatim
  ==============================================================================
                        ##### Event Generator functions #####
  ==============================================================================
    [..]  This section provides functions allowing to :
      (+) Configure an Event Generator.
      (+) Enable an Event Generator.
      (+) Disable an Event Generator.
@endverbatim
  * @{
  */

/**
  * @brief  This function configures an Event Generator.
  * @param  hgfxtim GFXTIM handle.
  * @param  EventGenerator Event Generator
  *           This parameter can be a value of @ref GFXTIM_EventGenerator.
  * @param  pEventGeneratorConfig pointer to a GFXTIM_EventGeneratorConfigTypeDef structure that
  *         contains Event Generator configuration parameters.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_GFXTIM_EventGenerator_Config(GFXTIM_HandleTypeDef *hgfxtim, uint32_t EventGenerator,
                                                   const GFXTIM_EventGeneratorConfigTypeDef *pEventGeneratorConfig)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t shift;

  if ((hgfxtim == NULL) || (pEventGeneratorConfig == NULL))
  {
    status = HAL_ERROR;
  }
  else
  {
    /* Check parameters */
    assert_param(IS_GFXTIM_EVENT_GENERATOR(EventGenerator));
    assert_param(IS_GFXTIM_EVENT_LINE(pEventGeneratorConfig->LineEvent));
    assert_param(IS_GFXTIM_EVENT_FRAME(pEventGeneratorConfig->FrameEvent));
    assert_param(IS_GFXTIM_INTERRUPT(pEventGeneratorConfig->EventInterrupt));

