zephyrproject-rtos/hal_stm32/stm32cube/stm32h5xx/drivers/src/stm32h5xx_hal_gfxtim.c
  if ((interrupts & GFXTIM_ISR_WDGAF) != 0U)
  {
#if (USE_HAL_GFXTIM_REGISTER_CALLBACKS == 1U)
    hgfxtim->HAL_GFXTIM_WatchdogTimer_AlarmCallback(hgfxtim);
#else
    HAL_GFXTIM_WatchdogTimer_AlarmCallback(hgfxtim);
#endif /* USE_HAL_GFXTIM_REGISTER_CALLBACKS */
  }

  if ((interrupts & GFXTIM_ISR_WDGPF) != 0U)
  {
#if (USE_HAL_GFXTIM_REGISTER_CALLBACKS == 1U)
    hgfxtim->HAL_GFXTIM_WatchdogTimer_PreAlarmCallback(hgfxtim);
#else
    HAL_GFXTIM_WatchdogTimer_PreAlarmCallback(hgfxtim);
#endif /* USE_HAL_GFXTIM_REGISTER_CALLBACKS */
  }
  /* Clear all pending interrupts */
  WRITE_REG(hgfxtim->Instance->ICR, interrupts);
}

/**
  * @brief  GFXTIM error callback.
  * @param  hgfxtim GFXTIM handle.
  * @retval None.
  */
__weak void HAL_GFXTIM_ErrorCallback(GFXTIM_HandleTypeDef *hgfxtim)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hgfxtim);

  /* NOTE : This function should not be modified, when the function is needed,
            the HAL_GFXTIM_ErrorCallback could be implemented in the user file. */
}

/**
  * @brief  This function get the current GFXTIM state.
  * @param  hgfxtim GFXTIM handle.
  * @retval GFXTIM state.
  */
HAL_GFXTIM_StateTypeDef HAL_GFXTIM_GetState(const GFXTIM_HandleTypeDef *hgfxtim)
{
  /* Return GFXTIM state */
  return hgfxtim->State;
}

/**
  * @brief  This function get the current GFXTIM error.
  * @param  hgfxtim GFXTIM handle.
  * @retval GFXTIM error code.
  */
uint32_t HAL_GFXTIM_GetError(const GFXTIM_HandleTypeDef *hgfxtim)
{
  /* Return GFXTIM error code */
  return hgfxtim->ErrorCode;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
#endif /* GFXTIM */
#endif /* HAL_GFXTIM_MODULE_ENABLED */
/**
  * @}
  */
